ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
/**
*   @file    Reg_eSys_ADCDig.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Adc - module register and macro definitions.
*   @details Adc module registers, and macrodefinitions used to manipulate the module registers.
*
*   @addtogroup ADC
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : ADCDIG
*   Dependencies         : none
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC560xB_MCAL_1_0_1_RTM_ASR_REL_4_0_REV_0003_20140606
*
*   (c) Copyright 2006-2014 Freescale Semiconductor Inc and STMicroelectronics
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_ADCDIG_H
#define REG_ESYS_ADCDIG_H

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Reg_eSys_ADCDig_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section  Reg_eSys_ADCDig_h_REF_2
* Violates MISRA 2004 Required Rule 19.15, Repeated include file.
* There are different kinds of execution code sections.
*
* @section Reg_eSys_ADCDig_h_REF_3
* Violates MISRA 2004 Required Rule 5.1, Identifiers shall not more than 31 characters
* Violation is needed because of Autosar restrictions for naming File version check macros.
*
*
* @section Reg_eSys_ADCDig_h_REF_4
* Violates MISRA 2004 Required Rule 20.2, The names of standard library macros, objects and
* functions shall not be reused. Symbol required to be defined when one compiler is used.
* Requested by AutoSAR (Req. COMPILER010).
*
* @section Reg_eSys_ADCDig_h_REF_5
* Violates MISRA 2004 Required Rule 8.12, Externally linked array size shall be defined
* This violation is needed to reduce code complexity because the array sizes are decided by 
* configuration but care is taken in code to respect the array bounds.
*
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_2 Repeated include file */
#include "Reg_eSys.h"
/* @violates @ref Reg_eSys_ADCDig_h_REF_2 Repeated include file */
#include "Adc_Cfg.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @file           Reg_eSys_ADCDig.h
*/
#define ADC_REG_VENDOR_ID                      (43)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_REG_AR_RELEASE_MAJOR_VERSION       (4)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_REG_AR_RELEASE_MINOR_VERSION       (0)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_REG_AR_RELEASE_REVISION_VERSION    (3)
#define ADC_REG_SW_MAJOR_VERSION               (1)
#define ADC_REG_SW_MINOR_VERSION               (0)
#define ADC_REG_SW_PATCH_VERSION               (1)

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/
/**
* @brief          These definitions are used to select the derivatives.
*/
#define IPV_ADCDIG_00_01_08_01 (0x10801UL) /**< @brief Bolero 512k cut2 - v1.8.a */
#define IPV_ADCDIG_00_02_02_02 (0x20202UL) /**< @brief Bolero 1.5M cut 1.0 - v2.2.b */
#define IPV_ADCDIG_00_03_09_01 (0x30901UL) /**< @brief Bolero 1.5M cut 2.0 - v3.9.a */
#define IPV_ADCDIG_00_02_00_01 (0x20001UL) /**< @brief Leopard - 2.0.a */
#define IPV_ADCDIG_00_01_05_01 (0x10501UL) /**< @brief Fado - 1.5.a */
#define IPV_ADCDIG_00_03_12_01 (0x31201UL) /**< @brief Bolero 3M && Bolero 256k && Bolero 128k - 3.12.a */
#define IPV_ADCDIG_00_01_06_01 (0x10601UL) /**< @brief Pictus 512k - 1.6.a, Pictus 256k - 1.6.c */
#define IPV_ADCDIG_00_03_13_01 (0x31301UL) /**< @brief Leopard cut2/cut3 && Pictus1M && Komodo2M && Leopard2M - 3.13.a */
#define IPV_ADCDIG_00_00_03_01 (0x00000301UL) /**< @brief Panther */
#define IPV_ADCDIG_00_00_04_12 (0x00000412UL) /**< @brief Rainier cut 1.0 */
#define IPV_ADCDIG_00_00_04_10 (0x00000410UL) /**< @brief Calypso cut 1.0 */

#define ADC_START_SEC_CONST_32
/* @violates @ref Reg_eSys_ADCDig_h_REF_2 Repeated include file MemMap.h */
#include "MemMap.h"

/**
* @brief Base address array for ADCDig
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_5 Externally linked array size shall be defined */
extern CONST(uint32, ADC_CONST) ADCDIG_BASE_ADDR[];

#define ADC_STOP_SEC_CONST_32
/* @violates @ref Reg_eSys_ADCDig_h_REF_2 Repeated include file MemMap.h */
#include "MemMap.h"

/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

/*==================================================================================================
*                                      DEFINES AND MACROS
==================================================================================================*/
/**
* @brief          ADC Base address definition.
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_ADDRESS(HwUnit)         (ADCDIG_BASE_ADDR[(HwUnit)])

/**
* @brief          Main Configuration Register (MCR).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_MCR_REG(HwUnit)           ((ADC_ADDRESS((HwUnit))+(uint32)0x0000UL))

/**
* @brief          Main Status Register (MSR).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_MSR_REG(HwUnit)           ((ADC_ADDRESS((HwUnit))+0x0004UL))

/**
* @brief          Reserved From 0x0008 to 0x000F.
*/

/**
* @brief          Interrupt Status Register (ISR).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_ISR_REG(HwUnit)           ((ADC_ADDRESS((HwUnit))+0x0010UL))

/**
* @brief          Channel Pending Register (CEOCFR0-2).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_CEOCFR0_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0014UL))
#ifdef IPV_ADCDIG
/* if !Leopard and !Leopard cut2/cut3 and !Pictus 1M and !Komodo and !Panther */
#if (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
  /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
  #define ADC_CEOCFR1_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0018UL))
  /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
  #define ADC_CEOCFR2_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x001CUL))
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)*/
#endif /* IPV_ADCDIG */

/**
* @brief          Interrupt Mask Register (IMR).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_IMR_REG(HwUnit)           ((ADC_ADDRESS((HwUnit))+0x0020UL))

/**
* @brief          Channel Interrupt Mask Register (CIMR0-2).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#ifdef IPV_ADCDIG
 /* if !Pictus512_256 */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
  /* if !Pictus1M */
  #ifndef IPV_ADCDIG_31301_PICTUS1M
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CIMR0_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x0024UL))
  #endif /* IPV_ADCDIG_31301_PICTUS1M */
  /* if !Leopard and !Leopard cut2/cut3 and !Komodo and !Panther */
  #if (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CIMR1_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x0028UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CIMR2_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x002CUL))
  #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */
#endif /* IPV_ADCDIG */

/**
* @brief          Watchdog Threshold Interrupt Status Register (WTISR).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_WTISR_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x0030UL))

/**
* @brief          Watchdog Threshold Interrupt Mask Register (WTIMR).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_WTIMR_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x0034UL))

/**
* @brief          Reserved From 0x0038 t0 0x003C on Bolero 1.5M.
* @details        On Bolero 512K these registers do not exists. 
*/

/**
* @brief          DMAE Register (DMAE).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_DMAE_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0040UL))

/**
* @brief          DMA Channel Select Register(DMAR0-2).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_DMAR0_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x0044UL))
#ifdef IPV_ADCDIG
 /* if !Pictus512_256 and !Leopard and !Leopard cut2/cut3 and !Pictus1M and !Komodo and !Panther*/
 #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
 /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
 #define ADC_DMAR1_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x0048UL))
 /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
 #define ADC_DMAR2_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x004CUL))
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) &&
           (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */
#endif /* IPV_ADCDIG */

/**
* @brief          Threshold Control Register (TRC0-3).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#ifdef IPV_ADCDIG
 /* if !Bolero 3M and !Leopard and !Leopard cut2/cut3 and !Pictus1M and !Komodo and !Panther and 
        !Rainier and !Calypso */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_03_12_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_TRC0_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0050UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_TRC1_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0054UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_TRC2_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0058UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_TRC3_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x005CUL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_TRCx_REG(HwUnit, Offset)  ((ADC_TRC0_REG((HwUnit)) + (uint32)(((uint32)(Offset))<<2)))
 #else /* Bolero 3M or Leopard or Leopard cut2/cut3 or Pictus1M or Komodo */
  /* if Pictus1M */
  #ifdef IPV_ADCDIG_31301_PICTUS1M
#define ADC_TRC0_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0050UL))
#define ADC_TRC1_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0054UL))
#define ADC_TRC2_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0058UL))
#define ADC_TRC3_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x005CUL))
#define ADC_TRCx_REG(HwUnit, Offset)  ((ADC_TRC0_REG((HwUnit)) + (uint32)(((uint32)(Offset))<<2)))
  #else
  /* reserved from 0x0050 - 0x005F */
  #endif /* IPV_ADCDIG_31301_PICTUS1M */
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_03_12_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) &&
           (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) &&
           (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10) */
#endif /* IPV_ADCDIG */

/**
* @brief          Threshold Register (THRHLR0-x).
*
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_THRHLR0_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0060UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_THRHLR1_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0064UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_THRHLR2_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0068UL))
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_THRHLR3_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x006CUL))
#endif /* IPV_ADCDIG_31201_BOLERO256K */
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_THRHLRx_REG(HwUnit, Offset) ((ADC_THRHLR0_REG((HwUnit)) + (uint32)(((uint32)(Offset))<<2)))
#ifdef IPV_ADCDIG
 /* if Bolero 1.5M or Leopard or Bolero 3M or Leopard cut2 or Pictus 1M or Komodo or Panther */
 #if (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || \
     (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || \
     (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
  #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
  #ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
  /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
  #define ADC_THRHLR_4_5x_REG(HwUnit,Offset) ((ADC_THRHLR4_REG((HwUnit))+(uint32)(((uint32)(Offset))<<2)))
  #endif /* IPV_ADCDIG_31201_BOLERO256K */
  #endif /* IPV_ADCDIG_31301_PICTUS1M */
 #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) ||
           (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) ||
           (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) */
#endif /* IPV_ADCDIG */

/**
* @brief          Threshold Register (THRALT0-3).
*
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#ifdef IPV_ADCDIG
 /* if Leopard cut1 */
 #if (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01)
   #define ADC_THRALT0_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0070UL))
   #define ADC_THRALT1_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0074UL))
   #define ADC_THRALT2_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0078UL))
   #define ADC_THRALT3_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x007CUL))
 #else
 /* Reserved From 0x0070 t0 0x007F */
 #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) */
#endif /* IPV_ADCDIG */

/**
* @brief          Presampling Control Register (PSCR).
* @details        Presampling Register (PSR0-2).
*
*/
#ifdef IPV_ADCDIG
 /* if !Pictus512_256 */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_PSCR_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0080UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_PSR0_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0084UL))
  /* if !Leopard and !Leopard cut2/cut3 and !Pictus1M and !Komodo 2M and !Panther */
  #if (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && \
      (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_PSR1_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0088UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_PSR2_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x008CUL))
  #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && 
            (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */
#endif /* IPV_ADCDIG */

/**
* @brief          Reserved From 0x0090 t0 0x0093.
*/

/**
* @brief          Conversion Timing Register (CTR0-2).
*
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_CTR0_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0094UL))
#ifdef IPV_ADCDIG
 /* if !Pictus512_256 */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
  /* if !Pictus1M */
  #ifndef IPV_ADCDIG_31301_PICTUS1M
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_CTR1_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x0098UL))
  #endif /* IPV_ADCDIG_31301_PICTUS1M */
  /* if !Leopard and !Leopard cut2 and !Pictus1M and !Komodo 2M and !Panther */
  #if (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && \
      (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_CTR2_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x009CUL))
  #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) &&
            (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */
#endif /* IPV_ADCDIG */

