ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
  /* Reserved From 0x00A0 t0 0x00A3 */
#else
  /* Reserved From 0x0098 t0 0x00A3 */
#endif /* IPV_ADCDIG_31201_BOLERO256K */

/**
* @brief          Normal Conversion Mask Register (NCMR0-2).
*
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_NCMR0_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x00A4UL))
#ifdef IPV_ADCDIG
 /* if !Pictus512_256 and !Leopard and !Leopard cut2/cut3 and !Pictus1M  and !Komodo 2M and !Panther */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_NCMR1_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x00A8UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_NCMR2_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x00ACUL))
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) &&
           (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */
#endif /* IPV_ADCDIG */

#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
  /* Reserved From 0x00B0 t0 0x00B3 */
#else
  /* Reserved From 0x00A8 t0 0x00B3 */
#endif /* IPV_ADCDIG_31201_BOLERO256K */
/**
* @brief          Injected Conversion Mask Register (JCMR0-2).
*
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_JCMR0_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x00B4UL))
#ifdef IPV_ADCDIG
 /* if !Pictus512_256 and !Leopard and !Leopard cut2/cut3 and !Pictus1M  and !Komodo 2M and !Panther */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_JCMR1_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x00B8UL))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_JCMR2_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x00BCUL))
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) &&
           (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)*/
#endif /* IPV_ADCDIG */

/**
* @brief          Offset Word Register (OFFWR).
*
*/
#ifdef IPV_ADCDIG
 /* if !Bolero 3M and !Leopard and !Leopard cut2/cut3 and !Pictus and !Komodo 2M and !Panther and
       !Rainier and !Calypso */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_03_12_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_OFFWR_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x00C0UL))
 #else /* Bolero 3M or Leopard or Leopard cut2/cut3 or Pictus or Komodo 2M  */
 /* reserved from 0x00C0 - 0x00C3 */
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_03_12_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) &&
           (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) &&
           (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10) */
#endif /* IPV_ADCDIG */

/**
* @brief          Decode Signals Delay Register (DSDR).
*
*/
#ifdef IPV_ADCDIG
 /* if !Pictus512_256 and !Leopard and !Leopard cut2/cut3 and !Pictus1M and !Komodo 2M and !Panther */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && \
     (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_DSDR_REG(HwUnit)          ((ADC_ADDRESS((HwUnit))+0x00C4UL))
 #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) &&
            (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */
#endif /* IPV_ADCDIG */

/**
* @brief          Power-down Exit Delay Register (PDEDR).
*
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_PDEDR_REG(HwUnit)         ((ADC_ADDRESS((HwUnit))+0x00C8UL))

/**
* @brief          Reserved From 0x00CC t0 0x00FF.
*/

/**
* @brief          Displacement of the first channel data register
*                 address relative to the ADC base address.
*
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_CH_DATA_REGISTERS_START_ADDRESS_OFFSET (0x0100UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_CH_DATA_REG(HwUnit,Ch) \
 (ADC_ADDRESS((HwUnit))+ADC_CH_DATA_REGISTERS_START_ADDRESS_OFFSET+((uint32)(((uint32)(Ch))<<2)))

/**
* @brief          Maximum Precision channel range from ANP0_ANP31
*                 (range from 0 to 32).
*/
#define ADC_ST_PRICISION_CH           (0U)
#define ADC_ED_PRICISION_CH           (31U)

/**
* @brief          Maximum medium accuracy Extended channel range from 
*                 ANS0_ANS31 (range from 32 to 63).
*/
#define ADC_ST_EXTENDED_CH            (32U)
#define ADC_ED_EXTENDED_CH            (63U)

/**
* @brief          Maximum external channel range from ANX0_ANX3 
*                (range from 64 to 95).
*/
#define ADC_ST_EXTERNAL_CH            (64U)
#define ADC_ED_EXTERNAL_CH            (95U)

/**
* @brief          Additional macro used for Bolero 512K and Fado.
*/
#if (IPV_ADCDIG == IPV_ADCDIG_00_01_08_01) || (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01)
#define ADC_MAX_PRICISION_COUNT       (16U)
#define ADC_MAX_EXTENDED_CH           (47U)
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_01_08_01) || (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01) */

/**
* @brief          Additional macro used for Bolero 1.5M / Leopard / 
*                 Bolero 3M / Leopard cut2 / Komodo 2M.
*
*/
#ifdef IPV_ADCDIG
 /* if Bolero 1.5M or Leopard or Bolero 3M or Leopard cut2/cut3 or Pictus 1M or Komodo 2M or Panther 
       or Rainier or Calypso */
 #if (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || \
     (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || \
     (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || \
     (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
  /* if !Pictus1M */
  #ifndef IPV_ADCDIG_31301_PICTUS1M
   /* !Bolero 256k-128k and !Rainier */
   #if (!defined(IPV_ADCDIG_31201_BOLERO256K)) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12)
   /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
   #define ADC_THRHLR4_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0280UL))
   /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
   #define ADC_THRHLR5_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0284UL))
   
   /* if Leopard or Leopard cut2/cut3 or Komodo 2M or Panther */
   #if (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || \
       (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR6_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0288UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR7_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x028CUL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR8_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0290UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR9_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x0294UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR10_REG(HwUnit)      ((ADC_ADDRESS((HwUnit))+0x0298UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR11_REG(HwUnit)      ((ADC_ADDRESS((HwUnit))+0x029CUL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR12_REG(HwUnit)      ((ADC_ADDRESS((HwUnit))+0x02A0UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR13_REG(HwUnit)      ((ADC_ADDRESS((HwUnit))+0x02A4UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR14_REG(HwUnit)      ((ADC_ADDRESS((HwUnit))+0x02A8UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_THRHLR15_REG(HwUnit)      ((ADC_ADDRESS((HwUnit))+0x02ACUL))
    #else
    /* Reserved From 0x0288 t0 0x02AF */
   #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) ||
             (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) */
   #endif /* !defined(IPV_ADCDIG_31201_BOLERO256K) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) &&
             (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10) */

   /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
   #define ADC_CWSEL0_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02B0UL))
   /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
   #define ADC_CWSEL1_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02B4UL))

   #if (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || \
       (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL2_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02B8UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL3_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02BCUL))
   #else
   /* Reserved From 0x02B8 t0 0x02BF */
   #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) ||
             (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10) */

    /* if !Leopard and !Leopard cut2/cut3 and !Komodo 2M and !Panther */
   #if (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && \
       (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL4_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02C0UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL5_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02C4UL))
    #ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL6_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02C8UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL7_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02CCUL))
    #endif /* !Bolero 256k-128k */
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL8_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02D0UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL9_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02D4UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL10_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x02D8UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWSEL11_REG(HwUnit)       ((ADC_ADDRESS((HwUnit))+0x02DCUL))
   #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) &&
             (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */
   /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
   #define ADC_CWENR0_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02E0UL))
   /* if Leopard and !Leopard cut2/cut3 and !Komodo 2M and !Panther */
   #if (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && \
       (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWENR1_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02E4UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_CWENR2_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02E8UL))
   #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && 
             (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */

   /* Reserved From 0x02EC t0 0x02EF */
   /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
   #define ADC_AWORR0_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02F0UL))
   /* if Leopard and !Leopard cut2/cut3 and !Komodo 2M and !Panther */
   #if (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && \
       (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_AWORR1_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02F4UL))
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define ADC_AWORR2_REG(HwUnit)        ((ADC_ADDRESS((HwUnit))+0x02F8UL))
   #endif /* (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) &&
             (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */

   #define ADC_CWSEL_RESET_VALUE (0x0UL)
   #define ADC_CWENR_RESET_VALUE (0x0UL)
   #define ADC_AWORR_REG_RESET_VALUE (0x0UL)
  #endif /* IPV_ADCDIG_31301_PICTUS1M */
 #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) ||
           (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) ||
           (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) ||
           (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10) */
#endif /* IPV_ADCDIG */

/**
* @brief          Offset to the lower part of the first Channel Data Register.
*/
#define ADC_CH_DATA_REG_OFFSET        (((uint32)ADC_CH_DATA_REGISTERS_START_ADDRESS_OFFSET+0x0002UL))

/**
* @brief          ADC Resoulution.
*/
#define ADC_BITS_RESOLUTION_10        (10U)
#define ADC_BITS_RESOLUTION_12        (12U)

/**********************************************************************************
***************                   Main Configuration Register (MCR) **************
**********************************************************************************/
/**
* @brief          OWREN: Overwrite enable.
* @details        If set to 1 the conversion data is overwritten by a 
*                 newer result otherwise it is discarded.
*/
#define ADC_OVERWRITE_EN ((uint32)0x80000000UL)
#define ADC_OVERWRITE_DIS (0x0UL)

/**
* @brief          WLSIDE: Write left /right-aligned.
* @details        0: The conversion data is written right-aligned.
*                 1: Data is left-aligned (from 15 to (15- resolution + 1)).
*/
#define ADC_WRITE_LEFT_ALIGNED ((uint32)0x40000000UL)
#define ADC_WRITE_RIGHT_ALIGNED ((uint32)0x0UL)

/**
* @brief          MODE: One_Shot/Scan.
* @details        0: One_Shot Mode - Configures the Normal conversion of one chain.
*                 1: Scan Mode - Configures continuous chain conversion mode; when the
*                 programmed chain conversion is finished it restarts immediately.
*/
#define ADC_ONE_SHOT_MODE (0x0UL)
#define ADC_CONTINUOUS_MODE (0x20000000UL)
#define ADC_CONVERSION_MODE (ADC_CONTINUOUS_MODE)

