ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#ifdef IPV_ADCDIG
 /* if !Bolero 1.5M cut 2, !Bolero 1.5M cut 1, !Bolero 512K, !Pictus512_256, !Leopard,
       !Leopard cut2/cut3 , !Pictus1M, !Komodo 2M   */
 #if ((IPV_ADCDIG != IPV_ADCDIG_00_03_09_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_02_02) && \
       (IPV_ADCDIG != IPV_ADCDIG_00_01_08_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) && \
       (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01))
 #ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
  /* EDGLEV: Edge or level selection for external start trigger
  Edge (EDGLEV = 0) or Level (EDGLEV = 1) configuration for external trigger usage*/
  #define ADC_EDGE_TRIGGER_MODE (0x0UL)
  #define ADC_LEVEL_TRIGGER_MODE (0x10000000UL)

/**
* @brief          TRGEN: External trigger enable.
* @details        When set enables the external trigger to start a conversion; 
*                 if the external trigger feature is needed this bit must be set.
*/
  #define ADC_EXT_TRIGGER_EN  (0x08000000UL)
  #define ADC_EXT_TRIGGER_DIS (0x0UL)

/**
* @brief          EDGE: Start trigger edge/level detection.
* @details        If TRGEN is one and EDGLEV is zero this bit selects the falling 
*                 (EDGE = 0) or rising (EDGE = 1) edge for the external trigger.
*                 If TRGEN is one and EDGLEV is one this bit selects the low 
*                 (EDGE = 0) or high (EDGE = 1) edge for the external trigger.
*/
#define ADC_EXT_TRIGGER_FALLING_EDGE (0x0UL)
#define ADC_EXT_TRIGGER_LOW_LEVEL (0x0UL)
#define ADC_EXT_TRIGGER_RISING_EDGE (0x04000000UL)
#define ADC_EXT_TRIGGER_HIGH_LEVEL (0x04000000UL)
#define ADC_EXT_TRIGGER_EDGE (ADC_EXT_TRIGGER_RISING_EDGE)
 #endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */
 #endif /* ((IPV_ADCDIG != IPV_ADCDIG_00_03_09_01) && (IPV_ADCDIG != IPV_ADCDIG_00_02_02_02) &&
            (IPV_ADCDIG != IPV_ADCDIG_00_01_08_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) &&
            (IPV_ADCDIG != IPV_ADCDIG_00_02_00_01) && (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01)) */
#endif /* IPV_ADCDIG */

/* if Fado or Bolero 3M or Panther or Rainier of Calypso */
#if (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
 #ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
/**
* @brief          XSTRTEN: External Start enable.
* @details        This bit can be used in order to synchronize th eSTART events of two ADCs.
*/
#define ADC_EXT_START_EN (0x02000000UL)
#define ADC_EXT_START_DIS (0x0UL)
 #endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || 
          (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) ||
          (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10) */

/**
* @brief          NSTART: Start conversion.
* @details        Setting this bit starts the chain or scan conversion, resetting this bit 
*                 during scan mode cause the current chain conversion to finish and stops 
*                 the operation.
*                 This bit keeps the high value until the conversion is ongoing 
*                 (or pending during injection mode).
*/
#define ADC_NORMAL_START_CONV_EN (0x01000000UL)
#define ADC_NORMAL_START_CONV_DIS (0x0UL)
#define ADC_NORMAL_CONV_STOP (0x01000000UL)

/**
* @brief          JTRGEN: Injection external trigger enable.
* @details        Setting this bit will enable the external trigger for channel injection.
*/
#define ADC_INJ_EXT_TRIGGER_EN (0x00400000UL)
#define ADC_INJ_EXT_TRIGGER_DIS (0x0UL)

/**
* @brief          JEDGE: Injection trigger edge selection.
* @details        Edge selection for external trigger; if JTRGEN is one this bit selects
*                 the falling (JEDGE = 0) or rising (JEDGE = 1) edge for the external trigger.
*/
#define ADC_INJ_TRIGGER_FALLING_EDGE (0x0UL)
#define ADC_INJ_TRIGGER_RISING_EDGE (0x00200000UL)
#define ADC_INJ_TRIGGER_EDGE (ADC_INJ_TRIGGER_RISING_EDGE)

/**
* @brief          JSTART: Injection start.
* @details        Setting this bit will start the configured injected analog channels to be
*                 converted by software; resetting this bit has no effect, as the injected chain
*                 conversion cannot be interrupted.
*/
#define ADC_INJ_START_CONV_EN (0x00100000UL)
#define ADC_INJ_START_CONV_DIS (0x0UL)

/* if Leopard cut2/cut3 or Pictus1M or Komodo 2M */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
/**
* @brief          Reference Range Expected.
* @details        This is a control bit that specifies the expected value of MSR[REF_RANGE].
*/
#define ADC_REF_RANGE_EXP_EN (0x00080000UL)
#define ADC_REF_RANGE_EXP_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) */

/**
* @brief          CTUEN: Cross Trigger Unit Enable.
* @details        0: The cross triggering unit is disabled and the triggered injected 
*                 conversion cannot take place.
*                 1: The cross triggering unit is enabled and the triggered injected
*                 conversion can take place.
*/
#define ADC_CTU_ENABLED (0x00020000UL)
#define ADC_CTU_DISABLED (0x0UL)

/* if !Bolero 3M */
#if (IPV_ADCDIG != IPV_ADCDIG_00_03_12_01)
/**
* @brief          ADCLKSEL: Analog clock frequency selector.
* @details        If this bit is set the AD_clk frequency is equal to ipg_clk frequency.
*                 Otherwise, it is half of ipg_clk frequency. That bit can be written
*                 in power-down only.
*/
#define ADC_CLOCK_PRESCALER_DIV1 (0x00000100UL)
#define ADC_CLOCK_PRESCALER_DIV2 ((uint32)0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_03_12_01) */

/* if Bolero 256k-128k */
#ifdef IPV_ADCDIG_31201_BOLERO256K /* Bolero 256k-128k */
/*ADCLKSEL: Analog clock frequency selector
If this bit is set the AD_clk frequency is equal to ipg_clk frequency. Otherwise, it is half of
ipg_clk frequency. That bit can be written in power-down only. */
  #define ADC_CLOCK_PRESCALER_DIV1 (0x00000100UL)
  #define ADC_CLOCK_PRESCALER_DIV2 ((uint32)0x0UL)
#endif /* IPV_ADCDIG_31201_BOLERO256K */

/**
* @brief          ABORT CHAIN: Abort Chain.
* @details        If this bit is set the ongoing chain conversion is aborted. This bit is reset
*                 by hardware as soon as a new conversion is requested.
*/
#define ADC_ABORT_CHAIN (0x00000080UL)

/**
* @brief          ABORT: Abort Conversion.
* @details        If this bit is set the ongoing conversion is aborted and a new conversion is
*                 invoked. This bit is reset by hardware as soon as the new conversion is invoked.
*/
#define ADC_ABORT_CHAN (0x00000040UL)

/**
* @brief          ACKO: Auto-clock-off enable.
* @details        If set enables the auto-clock-off feature.
*/
#define ADC_AUTO_CLKOFF_EN (0x00000020UL)
#define ADC_AUTO_CLKOFF_DIS ((uint32)0x0UL)

/* if Fado */
#if (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01)
/**
* @brief          OFFREFRESH: Offset refresh enable.
* @details        If set, this bit enables the offset refresh feature.
*/
#define ADC_OFFSET_REFRESH_EN (0x00000010UL)
#define ADC_OFFSET_REFRESH_DIS (0x0UL)

/**
* @brief          OFFCANC: Offset Cancellation.
* @details        This bit is reset to 0 when the offset calcellation ends.
*/
#define ADC_OFFCANC_EN (0x00000008UL)
#define ADC_OFFCANC_DIS (0x0UL)
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01) */

/**
* @brief          REFSEL: Reference voltage selection.
* @details        Select the reference voltage for ADC analog part.
*/
#define ADC_REFSEL_VREFH            (0x0UL)
#define ADC_REFSEL_VREFH_BAND_GAP   (0x00000002UL)
#define ADC_REFSEL_VREFH_ALTERNATE  (0x00000004UL)


/**
* @brief          PWDN: Power-down enable
* @details        When this bit is set, the analog module is requested to enter power-down mode.
*                 When ADC status is PWDN, resetting this bit will start ADC transition to IDLE mode.
*/
#if (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01)
  #define ADC_POWER_DOWN_EN ((uint32)0x00000101UL)
  #define ADC_POWER_DOWN_DIS (0x100UL)
  #define ADC_POWER_DOWN ((uint32)0x00000001UL)
  #define ADC_MCR_RESET_VALUE (0x00000101UL)
#else
  #define ADC_POWER_DOWN_EN ((uint32)0x00000001UL)
  #define ADC_POWER_DOWN_DIS (0x0UL)
  #define ADC_POWER_DOWN (ADC_POWER_DOWN_EN)
/* If Rainier or Calypso */
#if (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
  #define ADC_MCR_RESET_VALUE (0x00000101UL)
#else
  #define ADC_MCR_RESET_VALUE (0x00000001UL)
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)*/
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) */

/**********************************************************************************
***************               Main Status Register (MSR)             **************
**********************************************************************************/
/**
* @brief          NSTART.
* @details        This status bit is used to signal that a Normal conversion is ongoing.
*/
#define ADC_NORMAL_CONV_STATUS (0x01000000UL)
#define ADC_NORMAL_CONV_ONGOING (0x01000000UL)
#define ADC_NORMAL_CONV_FINISH (0x0UL)

/**
* @brief          JABORT.
* @details        This status bit is used to signal that an Injected conversion has been aborted.
*                 That bit is reset when a new injected conversion starts.
*/
#define ADC_INJ_ABORT_CONV_STATUS (0x00800000UL)
#define ADC_INJ_ABORT_CONV_ONGOING (0x00800000UL)
#define ADC_INJ_ABORT_CONV_FINISH (0x0UL)

/**
* @brief          JSTART.
* @details        This status bit is used to signal that an Injected conversion is ongoing.
*/
#define ADC_INJ_CONV_STATUS (0x00100000UL)
#define ADC_INJ_CONV_ONGOING (0x00100000UL)
#define ADC_INJ_CONV_FINISH (0x0UL)

/* if Leopard cut2/cut3 or Pictus 1M */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
/**
* @brief          REF_RANGE.
* @details        This bit defines the voltage range for operation of the ADC. It is provided
*                 as an output by the ADC, along with data, after every conversion.
*/
#define ADC_REF_RANGE_LESS_EQUAL_36V (0x00000000UL)
#define ADC_REF_RANGE_GREATER_45V (0x00080000UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) */

/**
* @brief          CTUSTART.
* @details        This status bit is used to signal that a CTU conversion is ongoing.
*                 This bit is set when a CTU trigger pulse is received and the CTU conversion starts.
*                 When CTU trigger mode is enabled this bit is automatically reset when the conversion
*                 is completed. Otherwise, if Control Mode is enabled this bit is reset when the CTU 
*                 is disabled.
*/
#define ADC_CTU_CONV_STATUS (0x00010000UL)
#define ADC_CTU_CONV_ONGOING (0x00010000UL)
#define ADC_CTU_CONV_FINISH (0x0UL)

/**
* @brief          CHADDR:Channel address.
* @details        Channel under measure address.
*                 This status bit is used to signal which channel is under measure.
*/
#define ADC_CH_UNDER_CONVERTION (0x0000FE00UL)

/**
* @brief          ACKO: Auto-clock-off enable.
* @details        This status bit is used to signal if the Auto-clock-off feature is on.
*/
#define ADC_AUTO_CLK_OFF_STATUS (0x00000020UL)

#if (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01)
/**
* @brief          ADC_OFFREFRESH_STATUS - ADC_OFFCANC_STATUS.
* @details        Offset refresh and cancellation.
*/
#define ADC_OFFREFRESH_STATUS (0x00000010UL)
#define ADC_OFFCANC_STATUS (0x00000008UL)
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01) */

/**
* @brief          ADCSTATUS
* @details        Adc Status.
*/
#define ADC_STATUS (0x00000007UL)
#define ADC_IDLE_OFFSET_STATUS (0x0UL)
#define ADC_POWERDOWN_STATUS (0x00000001UL)
#define ADC_WAIT_STATE_STATUS (0x00000002UL)
#define ADC_SAMPLE_STATUS (0x00000004UL)
#define ADC_CONVERSION_STATUS (0x00000006UL)

/**********************************************************************************
***************               Interrupt Status Register (ISR)        **************
**********************************************************************************/
/**
* @brief          ECH.
* @details        End of chain conversion.
*/
#define ADC_ISR_END_CHAIN_NORM_CONV (0x00000001UL)
#define ADC_ISR_END_CHAIN_NORM_CLEAN (0x00000001UL)

/**
* @brief          EOC.
* @details        End of channel conversion.
*/
#define ADC_ISR_END_CHANNEL_NORM_CONV (0x00000002UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ISR_END_CHANNEL_NORM_CONV_CLEAN (0x00000002UL)

/**
* @brief          JECH.
* @details        End of injected chain conversion.
*/
#define ADC_ISR_END_CHAIN_INJ_CONV (0x00000004UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ISR_END_CHAIN_INJ_CONV_CLEAN (0x00000004UL)

/**
* @brief          JEOC.
* @details        End of injected channel conversion.
*/
#define ADC_ISR_END_CHANNEL_INJ_CONV (0x00000008UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ISR_END_CHANNEL_INJ_CONV_CLEAN (0x00000008UL)

/**
* @brief          EOCTU.
* @details        End of CTU conversion.
*                 It is the interrupt of the digital end of conversion for the CTU channel;
*                 active when set.
*/
#define ADC_ISR_END_CHANNEL_CTU_CONV (0x00000010UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ISR_END_CHANNEL_CTU_CONV_CLEAN (0x00000010UL)

/* if Fado */
#if (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01)
/**
* @brief          EOFFSET.
* @details        Error in offset refresh.
*                 It is the interrupt of the error in offset refresh: it's generated during the
*                 offset cancellation phase; active when set. */
#define ADC_ISR_ERROR_IN_OFFSET_REFRESH (0x00000020UL)
#define ADC_ISR_ERROR_OFFSET_REFRESH_CLEAN (0x00000020UL)

/**
* @brief          OFFCANCOVR.
* @details        Offset Cancellatin Phase Over.
*                 It is the interupt when the ADC generates the offset_ok_i to high indication
*                 then the offset cancellation phase programmed by the user is over and the offset
*                 coefficient is written into the offset register; active when set.
*/
#define ADC_ISR_OFFSET_IN_CANC_OVER (0x00000040UL)
#define ADC_ISR_OFFSET_IN_CANC_OVER_CLEAN (0x00000040UL)
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01) */

/* if Leopard cut2/cut3 or Pictus1M or Komodo 2M  */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
/**
* @brief          REF_RANGE.
* @details        This bit is set if REF_RANGE output from the ADC does not match with the expected
*                 value programmed in the MCR.
*/
#define ADC_ISR_REF_RANGE_NOT_MATCH_SET (0x00008000UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ISR_REF_RANGE_NOT_MATCH_CLEAN (0x00008000UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) */

#define ADC_ISR_RESET_VALUE  (0x00000000UL)

/**********************************************************************************
***************    Ch Pending Status Register (CEOCFRx)             **************
**********************************************************************************/
/* if !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
/**
* @brief          CEOCFR0 reset value.
*/
#define ADC_CEOCFR0_RESET_VALUE  (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          EOC_CHn When set, the measure of channel n is completed.
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_COMPLETED_CH_CONVERSION(Ch) ((uint32)(1<<(Ch)))

/**********************************************************************************
***************        Interrupt Mask Register (IMR)                **************
**********************************************************************************/

/**
* @brief          MSKECH.
* @details        Mask bit for ECH.
*/
#define ADC_ISR_END_CHAIN_NORM_CONV_EN (0x00000001UL)
#define ADC_ISR_END_CHAIN_NORM_CONV_DIS (0x0UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ISR_END_CHAIN_NORM_CONV_MASK (ADC_ISR_END_CHAIN_NORM_CONV_EN)

/**
* @brief          MSKJECH.
* @details        Mask bit for JECH.
*/
#define ADC_ISR_END_CHAIN_INJ_CONV_EN (0x00000004UL)
#define ADC_ISR_END_CHAIN_INJ_CONV_DIS (0x0UL)
#define ADC_ISR_END_CHAIN_INJ_CONV_MASK (ADC_ISR_END_CHAIN_INJ_CONV_EN)

/**
* @brief          MSKJEOC.
* @details        Mask bit for JEOC.
*/
#define ADC_ISR_END_CHANNEL_INJ_CONV_EN (0x00000008UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ISR_END_CHANNEL_INJ_CONV_DIS (0x0UL)

/**
* @brief          MSKEOCTU.
* @details        Mask bit for EOCTU.
*                 When set, the interrupt is enabled.
*/
#define ADC_ISR_END_CHANNEL_CTU_CONV_EN (0x00000010UL)
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ISR_END_CHANNEL_CTU_CONV_DIS (0x0UL)

/* if Fado */
#if (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01)
/**
* @brief          MSKEOFFSET.
* @details        Mask bit for EOFFSET.
*/
#define ADC_ISR_ERROR_OFFSET_REFRESH_EN (0x00000020UL)
#define ADC_ISR_ERROR_OFFSET_REFRESH_DIS (0x0UL)

/**
* @brief          MSKJEOC.
* @details        Mask bit for JEOC.
*/
#define ADC_ISR_OFFSET_CANC_OVER_EN (0x00000040UL)
#define ADC_ISR_OFFSET_CANC_OVER_DIS (0x0UL)
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_01_05_01) */

/* if Leopard cut2/cut3 or Pictus1M or Komodo 2M  */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
/**
* @brief          MSK_REF_RANGE.
* @details        Mask bit for REF_RANGE.
*/
#define ADC_ISR_REF_RANGE_EN (0x00008000UL)
#define ADC_ISR_REF_RANGE_DIS (0x0UL)
#define ADC_ISR_REF_RANGE_MASK (ADC_ISR_REF_RANGE_EN)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) */

