ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#define ADC_IMR_RESET_VALUE  (0x0UL)

/**********************************************************************************
***************      Ch Interrupt Mask Register (CIMRx)              **************
**********************************************************************************/
/**
* @brief          When set (CIMn = 1), interrupt for channel n is enabled.
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
#define ADC_ENABLE_END_ISR_CH_CONVERSION(Ch) ((uint32)(1<<(Ch)))

#define ADC_CIMR_RESET_VALUE  (0x0UL)

/**********************************************************************************
****************   WatchDog Threshold Interrupt Status Register (WTISR) ***********
**********************************************************************************/
/**
* @brief          WDG0L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 0.
*/
/* !Fado and !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH0_LOW_ISR_STATUS (0x00000001UL)
 #else /* Pictus1M */
#define ADC_WTH0_LOW_ISR_STATUS (0x00000001UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH0_LOW_ISR_STATUS (0x00000001UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          WDG1L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 1.
*/
/* !Fado and !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH1_LOW_ISR_STATUS (0x00000004UL)
 #else /* Pictus1M */
#define ADC_WTH1_LOW_ISR_STATUS (0x00000002UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH1_LOW_ISR_STATUS (0x00000002UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          WDG2L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 2.
*/
/* !Fado and !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH2_LOW_ISR_STATUS (0x00000010UL)
 #else /* Pictus1M */
#define ADC_WTH2_LOW_ISR_STATUS (0x00000004UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH2_LOW_ISR_STATUS (0x00000004UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
/**
* @brief          WDG3L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 3.
*/
/* !Fado and !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
#define ADC_WTH3_LOW_ISR_STATUS (0x00000040UL)
 #else /* Pictus1M */
#define ADC_WTH3_LOW_ISR_STATUS (0x00000008UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH3_LOW_ISR_STATUS (0x00000008UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
/**
* @brief          WDG4L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 4.
*/
#define ADC_WTH4_LOW_ISR_STATUS (0x00000100UL)
/**
* @brief          WDG5L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 5.
*/
#define ADC_WTH5_LOW_ISR_STATUS (0x00000400UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/* if Leopard cut2/cut3 or Pictus1M or Komodo 2M or Panther or Rainier */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
/**
* @brief          WDG6L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 6.
*/
#define ADC_WTH6_LOW_ISR_STATUS (0x00001000UL)

/**
* @brief          WDG7L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 7.
*/
#define ADC_WTH7_LOW_ISR_STATUS (0x00004000UL)

/**
* @brief          WDG8L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 8.
*/
#define ADC_WTH8_LOW_ISR_STATUS (0x00010000UL)

/**
* @brief          WDG9L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 9.
*/
#define ADC_WTH9_LOW_ISR_STATUS (0x00040000UL)

/**
* @brief          WDG10L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 10.
*/
#define ADC_WTH10_LOW_ISR_STATUS (0x00100000UL)

/**
* @brief          WDG11L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 11.
*/
#define ADC_WTH11_LOW_ISR_STATUS (0x00400000UL)

/**
* @brief          WDG12L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 12.
*/
#define ADC_WTH12_LOW_ISR_STATUS (0x01000000UL)

/**
* @brief          WDG13L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 13.
*/
#define ADC_WTH13_LOW_ISR_STATUS (0x04000000UL)

/**
* @brief          WDG14L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 14.
*/
#define ADC_WTH14_LOW_ISR_STATUS (0x10000000UL)

/**
* @brief          WDG15L.
* @details        This corresponds to the interrupt generated on the converted value being
*                 lower than the programmed lower threshold 15.
*/
#define ADC_WTH15_LOW_ISR_STATUS (0x40000000UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) 
          (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) */
#endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */

/**
* @brief          WDG0H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 0.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH0_HIGH_ISR_STATUS (0x00000002UL)
 #else /* Pictus1M */
#define ADC_WTH0_HIGH_ISR_STATUS (0x00000010UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH0_HIGH_ISR_STATUS (0x00000010UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          WDG1H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 1.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH1_HIGH_ISR_STATUS (0x00000008UL)
 #else /* Pictus1M */
#define ADC_WTH1_HIGH_ISR_STATUS (0x00000020UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH1_HIGH_ISR_STATUS (0x00000020UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          WDG2H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 2.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
/* if !Pictus1M */
#ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH2_HIGH_ISR_STATUS (0x00000020UL)
 #else /* Pictus1M */
#define ADC_WTH2_HIGH_ISR_STATUS (0x00000040UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH2_HIGH_ISR_STATUS (0x00000040UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

