ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
/**
* @brief          WDG3H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 3.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH3_HIGH_ISR_STATUS (0x00000080UL)
 #else /* Pictus1M */
#define ADC_WTH3_HIGH_ISR_STATUS (0x00000080UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH3_HIGH_ISR_STATUS (0x00000080UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
/**
* @brief          WDG4H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 4.
*/
#define ADC_WTH4_HIGH_ISR_STATUS (0x00000200UL)

/**
* @brief          WDG5H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 5.
*/
#define ADC_WTH5_HIGH_ISR_STATUS (0x00000800UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/* if Leopard cut2/cut3 or Pictus1M or Komodo 2M or Panther or Rainier */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
    /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
/**
* @brief          WDG6H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 6.
*/
#define ADC_WTH6_HIGH_ISR_STATUS (0x00002000UL)

/**
* @brief          WDG7H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 7.
*/
#define ADC_WTH7_HIGH_ISR_STATUS (0x00008000UL)

/**
* @brief          WDG8H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 8.
*/
#define ADC_WTH8_HIGH_ISR_STATUS (0x00020000UL)

/**
* @brief          WDG9H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 9.
*/
#define ADC_WTH9_HIGH_ISR_STATUS (0x00080000UL)

/**
* @brief          WDG10H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 10.
*/
#define ADC_WTH10_HIGH_ISR_STATUS (0x00200000UL)

/**
* @brief          WDG11H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 11.
*/
#define ADC_WTH11_HIGH_ISR_STATUS (0x00800000UL)

/**
* @brief          WDG12H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 12.
*/
#define ADC_WTH12_HIGH_ISR_STATUS (0x02000000UL)

/**
* @brief          WDG13H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 13.
*/
#define ADC_WTH13_HIGH_ISR_STATUS (0x08000000UL)

/**
* @brief          WDG14H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 14.
*/
#define ADC_WTH14_HIGH_ISR_STATUS (0x20000000UL)

/**
* @brief          WDG15H.
* @details        This corresponds to the interrupt generated on the converted value being 
*                 greater than the programmed higher threshold 15.
*/
#define ADC_WTH15_HIGH_ISR_STATUS (0x80000000UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) ||
          (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) */
#endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */

#define ADC_WTISR_RESET_VALUE  (0x0UL)

/**********************************************************************************
**************   WatchDog Threshold Interrupt Mask Register (WTIMR)  **************
**********************************************************************************/
/**
* @brief          MSKWDG0L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 0.
*                 When set the interrupt is enabled.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
/* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M 
#define ADC_WTH0_LOW_ISR_EN (0x00000001UL)
#define ADC_WTH0_LOW_ISR_DIS (0x0UL)
 #else /* Pictus1M */
#define ADC_WTH0_LOW_ISR_EN (0x00000001UL)
#define ADC_WTH0_LOW_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH0_LOW_ISR_EN (0x00000001UL)
#define ADC_WTH0_LOW_ISR_DIS (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          MSKWDG1L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 1.
*                 When set the interrupt is enabled.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH1_LOW_ISR_EN (0x00000004UL)
#define ADC_WTH1_LOW_ISR_DIS (0x0UL)
 #else /* Pictus1M */
#define ADC_WTH1_LOW_ISR_EN (0x00000002UL)
#define ADC_WTH1_LOW_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH1_LOW_ISR_EN (0x00000002UL)
#define ADC_WTH1_LOW_ISR_DIS (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          MSKWDG2L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 2.
*                 When set the interrupt is enabled.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH2_LOW_ISR_EN (0x00000010UL)
#define ADC_WTH2_LOW_ISR_DIS (0x0UL)
 #else /* Pictus1M */
#define ADC_WTH2_LOW_ISR_EN (0x00000004UL)
#define ADC_WTH2_LOW_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH2_LOW_ISR_EN (0x00000004UL)
#define ADC_WTH2_LOW_ISR_DIS (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

