ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
/**
* @brief          MSKWDG3L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 3.
*                 When set the interrupt is enabled.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH3_LOW_ISR_EN (0x00000040UL)
#define ADC_WTH3_LOW_ISR_DIS (0x0UL)
 #else /* Pictus1M */
#define ADC_WTH3_LOW_ISR_EN (0x00000008UL)
#define ADC_WTH3_LOW_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH3_LOW_ISR_EN (0x00000008UL)
#define ADC_WTH3_LOW_ISR_DIS (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
/**
* @brief          MSKWDG4L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 4.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH4_LOW_ISR_EN (0x00000100UL)
#define ADC_WTH4_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG5L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 5.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH5_LOW_ISR_EN (0x00000400UL)
#define ADC_WTH5_LOW_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/* if Leopard cut2/cut3 or Pictus1M or Komodo 2M or Rainier */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
/**
* @brief          MSKWDG6L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 6.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH6_LOW_ISR_EN (0x00001000UL)
#define ADC_WTH6_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG7L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 7.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH7_LOW_ISR_EN (0x00004000UL)
#define ADC_WTH7_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG8L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 8.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH8_LOW_ISR_EN (0x00010000UL)
#define ADC_WTH8_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG9L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 9.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH9_LOW_ISR_EN (0x00040000UL)
#define ADC_WTH9_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG10L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 10.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH10_LOW_ISR_EN (0x00100000UL)
#define ADC_WTH10_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG11L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 11.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH11_LOW_ISR_EN (0x00400000UL)
#define ADC_WTH11_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG12L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 12.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH12_LOW_ISR_EN (0x01000000UL)
#define ADC_WTH12_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG13L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 13.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH13_LOW_ISR_EN (0x04000000UL)
#define ADC_WTH13_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG14L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 14.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH14_LOW_ISR_EN (0x10000000UL)
#define ADC_WTH14_LOW_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG15L.
* @details        This corresponds to the mask bit for the interrupt generated on the converted 
*                 value being lower than the programmed lower threshold 15.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH15_LOW_ISR_EN (0x40000000UL)
#define ADC_WTH15_LOW_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || 
          (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) */
#endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */

/**
* @brief          MSKWDG0H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 0. 
*                 When set the interrupt is enabled.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH0_HIGH_ISR_EN (0x00000002UL)
#define ADC_WTH0_HIGH_ISR_DIS (0x0UL)
 #else /* Pictus1M */
#define ADC_WTH0_HIGH_ISR_EN (0x00000010UL)
#define ADC_WTH0_HIGH_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH0_HIGH_ISR_EN (0x00000010UL)
#define ADC_WTH0_HIGH_ISR_DIS (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          MSKWDG1H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 1.
*                 When set the interrupt is enabled.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH1_HIGH_ISR_EN (0x00000008UL)
#define ADC_WTH1_HIGH_ISR_DIS (0x0UL)
 #else /* Pictus1M */
#define ADC_WTH1_HIGH_ISR_EN (0x00000020UL)
#define ADC_WTH1_HIGH_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH1_HIGH_ISR_EN (0x00000020UL)
#define ADC_WTH1_HIGH_ISR_DIS (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**
* @brief          MSKWDG2H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 2.
*                 When set the interrupt is enabled.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH2_HIGH_ISR_EN (0x00000020UL)
#define ADC_WTH2_HIGH_ISR_DIS (0x0UL)
 #else /* Pictus1M */
#define ADC_WTH2_HIGH_ISR_EN (0x00000040UL)
#define ADC_WTH2_HIGH_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH2_HIGH_ISR_EN (0x00000040UL)
#define ADC_WTH2_HIGH_ISR_DIS (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

