ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
/**
* @brief          MSKWDG3H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 3.
*                 When set the interrupt is enabled.
*/
/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_WTH3_HIGH_ISR_EN (0x00000080UL)
#define ADC_WTH3_HIGH_ISR_DIS (0x0UL)
 #else /* Pictus1M */
#define ADC_WTH3_HIGH_ISR_EN (0x00000080UL)
#define ADC_WTH3_HIGH_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#else /* Fado or Pictus512_256 */
#define ADC_WTH3_HIGH_ISR_EN (0x00000080UL)
#define ADC_WTH3_HIGH_ISR_DIS (0x0UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/* if !Fado && !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
/**
* @brief          MSKWDG4H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 4.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH4_HIGH_ISR_EN (0x00000200UL)
#define ADC_WTH4_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG5H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 5.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH5_HIGH_ISR_EN (0x00000800UL)
#define ADC_WTH5_HIGH_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/* if Leopard cut2/cut3 or Pictus1M or Komodo 2M or Rainier */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
/**
* @brief          MSKWDG6H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 6.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH6_HIGH_ISR_EN (0x00002000UL)
#define ADC_WTH6_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG7H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 7.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH7_HIGH_ISR_EN (0x00008000UL)
#define ADC_WTH7_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG8H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 8.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH8_HIGH_ISR_EN (0x00020000UL)
#define ADC_WTH8_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG9H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 9.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH9_HIGH_ISR_EN (0x00080000UL)
#define ADC_WTH9_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG10H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 10.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH10_HIGH_ISR_EN (0x00200000UL)
#define ADC_WTH10_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG11H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 11.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH11_HIGH_ISR_EN (0x00800000UL)
#define ADC_WTH11_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG12H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 12.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH12_HIGH_ISR_EN (0x02000000UL)
#define ADC_WTH12_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG13H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 13.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH13_HIGH_ISR_EN (0x08000000UL)
#define ADC_WTH13_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG14H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 14.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH14_HIGH_ISR_EN (0x20000000UL)
#define ADC_WTH14_HIGH_ISR_DIS (0x0UL)

/**
* @brief          MSKWDG15H.
* @details        This corresponds to the mask bit for the interrupt generated on the converted value
*                 being higher than the programmed higher threshold 15.
*                 When set the interrupt is enabled.
*/
#define ADC_WTH15_HIGH_ISR_EN (0x80000000UL)
#define ADC_WTH15_HIGH_ISR_DIS (0x0UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) ||
          (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) */
#endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */

#define ADC_WTIMR_RESET_VALUE  (0x0UL)

/**********************************************************************************
***************             DMAE Register (DMAE)                    **************
**********************************************************************************/
/**
* @brief          DMAEN.
* @details        DMA global enable.
*                 When this bit is set, the DMA feature is enabled.
*/
#define ADC_DMA_GLOBAL_EN (0x00000001UL)
#define ADC_DMA_GLOBAL_DIS (0x0UL)

/**
* @brief          DCLR.
* @details        DMA clear sequence enable.
*                 0: DMA request cleared by Acknowledge from DMA controller
*                 1: DMA request cleared on read of data registers.
*/
#define ADC_DMA_REQ_CLEAR_ON_READ (0x00000002UL)
#define ADC_DMA_REQ_CLEAR_ON_ACK (0x0UL)

#define ADC_DMAE_RESET_VALUE  (0x0UL)

/**********************************************************************************
***************                  DMA Register (DMAR)                **************
**********************************************************************************/
/**
* @brief          When set (DMAn = 1), channel n is enabled to transfer data in DMA mode.
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_ENABLE_DMA_TRANSFER(Ch) ((uint32)(1<<(Ch)))

