ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#define ADC_DMAR_RESET_VALUE  (0x0UL)


/**********************************************************************************
***************    Threshold Control Register (TRCx)                **************
**********************************************************************************/
/**
* @brief          THRCH.
* @details        Choose the channel for threshold comparison.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_CH_THRESHOLD_COMP(x) ((uint32)(x))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_TH_OUTPUT_PIN_INVERT(x)     ((uint32)(((uint32)(x))<<14))
#define INVERT_OUTPUT_PIN               (0x1U)
#define NO_INVERT_OUTPUT_PIN            (0x1U)

/**
* @brief          THREN.
* @details        Threshold enable
*                 When set, this bit enables the threshold detection feature for the selected channel.
*/
#define ADC_TH_ENABLE (0x8000U)
#define ADC_TH_DISABLE (0x0000U)

/**
* @brief          TRCx reset values.
*/
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
#define ADC_TRC0_RESET_VALUE          (0x0UL)
#define ADC_TRC1_RESET_VALUE          (0x0UL)
#define ADC_TRC2_RESET_VALUE          (0x0UL)
#define ADC_TRC3_RESET_VALUE          (0x0UL)
#define ADC_TRCx_RESET_VALUE          (0x0UL)
#endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */

/**
* @brief          Threshold register values
*/
#define ADC_THRESHOLD_REG_0           ((uint8)0x0)
#define ADC_THRESHOLD_REG_1           ((uint8)0x1)
#define ADC_THRESHOLD_REG_2           ((uint8)0x2)
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
#define ADC_THRESHOLD_REG_3           ((uint8)0x3)
#endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */
#ifdef IPV_ADCDIG
/* if Bolero 1.5M or Leopard or Bolero 3M or Leopard cut 2 or Pictus1M or Komodo 2M or Panther or Calypso */
 #if (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || \
     (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || \
     (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
  /* if !Pictus1M */
  #ifndef IPV_ADCDIG_31301_PICTUS1M
   #ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
   #define ADC_THRESHOLD_REG_4           ((uint8)0x4)
   #define ADC_THRESHOLD_REG_5           ((uint8)0x5)
   #endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */
  #endif /* IPV_ADCDIG_31301_PICTUS1M */
 #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) ||
           (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) ||
           (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) */
#endif /* IPV_ADCDIG */
/* if Leopard or Leopard cut2/cut3 or Pictus1M or Komodo 2M or Panther */
#if (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01)
 #ifndef IPV_ADCDIG_31301_PICTUS1M /* if !Pictus1M */
   #define ADC_THRESHOLD_REG_6           ((uint8)0x6)
   #define ADC_THRESHOLD_REG_7           ((uint8)0x7)
   #define ADC_THRESHOLD_REG_8           ((uint8)0x8)
   #define ADC_THRESHOLD_REG_9           ((uint8)0x9)
   #define ADC_THRESHOLD_REG_10          ((uint8)0xA)
   #define ADC_THRESHOLD_REG_11          ((uint8)0xB)
   #define ADC_THRESHOLD_REG_12          ((uint8)0xC)
   #define ADC_THRESHOLD_REG_13          ((uint8)0xD)
   #define ADC_THRESHOLD_REG_14          ((uint8)0xE)
   #define ADC_THRESHOLD_REG_15          ((uint8)0xF)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) ||
          (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) */

/**********************************************************************************
***************   Threshold  Register (THRHLRx)                      **************
**********************************************************************************/
/**
* @brief          THRH.
* @details        High threshold value for channel x
* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined
*/
#define ADC_HIGH_TH_VALUE(Th) ((uint32)((uint32)(Th)<<16))

/**
* @brief          THRL.
* @details        Low threshold value for channel x
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH_VALUE(Th) ((uint32)(Th))

/**
* @brief          Low and High threshold values.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH0_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH1_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH2_VALUE(Th) ((uint32)(Th))
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH3_VALUE(Th) ((uint32)(Th))
#endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH0_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH1_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH2_VALUE(Th) ((uint32)((uint32)(Th)<<16))
#ifndef IPV_ADCDIG_31201_BOLERO256K /* !Bolero 256k-128k */
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH3_VALUE(Th) ((uint32)((uint32)(Th)<<16))
#endif /* ifndef IPV_ADCDIG_31201_BOLERO256K */
/* if Leopard cut2/cut3 or Pictus1M or Komodo 2M or Panther or Calypso */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH4_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH5_VALUE(Th) ((uint32)(Th))

 /* !Calypso */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH6_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH7_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH8_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH9_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH10_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH11_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH12_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH13_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH14_VALUE(Th) ((uint32)(Th))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_LOW_TH15_VALUE(Th) ((uint32)(Th))
 #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10) */
 
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH4_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH5_VALUE(Th) ((uint32)((uint32)(Th)<<16))

 /* !Calypso */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH6_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH7_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH8_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH9_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH10_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH11_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH12_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH13_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH14_VALUE(Th) ((uint32)((uint32)(Th)<<16))
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_HIGH_TH15_VALUE(Th) ((uint32)((uint32)(Th)<<16))
 #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10) */
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) */

/**
* @brief          Threshold reset values.
*/
/* If !Calypso */
#if (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
/* !Bolero 256k-128k and !Rainier and !Calypso */
#if (!defined(IPV_ADCDIG_31201_BOLERO256K)) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12)
/* if !Leopard cut2/cut3 and !Pictus1M and !Komodo 2M and !Panther */
#if (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01)
#define ADC_UNUSED_THRESHOLD          (0x0UL)
#define ADC_THRHLR0_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR1_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR2_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR3_RESET_VALUE       (0x03FF0000UL)
#define ADC_THRHLRx_RESET_VALUE       (0x03FF0000UL)
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
#define ADC_THRHLR4_RESET_VALUE       (0x03FF0000UL)
#define ADC_THRHLR5_RESET_VALUE       (0x03FF0000UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_05_01) && (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */
#else /* Leopard cut2/cut3 or Pictus1M or Komodo 2M */
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
#define ADC_UNUSED_THRESHOLD          (0x0UL)
#define ADC_THRHLR0_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR1_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR2_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR3_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR4_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR5_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR6_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR7_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR8_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR9_RESET_VALUE       (0x0FFF0000UL)
#define ADC_THRHLR10_RESET_VALUE      (0x0FFF0000UL)
#define ADC_THRHLR11_RESET_VALUE      (0x0FFF0000UL)
#define ADC_THRHLR12_RESET_VALUE      (0x0FFF0000UL)
#define ADC_THRHLR13_RESET_VALUE      (0x0FFF0000UL)
#define ADC_THRHLR14_RESET_VALUE      (0x0FFF0000UL)
#define ADC_THRHLR15_RESET_VALUE      (0x0FFF0000UL)
#define ADC_THRHLRx_RESET_VALUE       (0x0FFF0000UL)
 #else /* Pictus1M */
#define ADC_UNUSED_THRESHOLD          (0x0UL)
#define ADC_THRHLR0_RESET_VALUE       (0x03FF0000UL)
#define ADC_THRHLR1_RESET_VALUE       (0x03FF0000UL)
#define ADC_THRHLR2_RESET_VALUE       (0x03FF0000UL)
#define ADC_THRHLR3_RESET_VALUE       (0x03FF0000UL)
#define ADC_THRHLRx_RESET_VALUE       (0x03FF0000UL)
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_03_13_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */
#else /* Bolero 256k-128k or Rainier */
  #define ADC_UNUSED_THRESHOLD          (0x0UL)
  #define ADC_THRHLR0_RESET_VALUE       (0x0FFF0000UL)
  #define ADC_THRHLR1_RESET_VALUE       (0x0FFF0000UL)
  #define ADC_THRHLR2_RESET_VALUE       (0x0FFF0000UL)
  /* Rainier */
  #if (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12)
    #define ADC_THRHLR3_RESET_VALUE     (0x0FFF0000UL)
  #endif
  #define ADC_THRHLRx_RESET_VALUE       (0x0FFF0000UL)
#endif /* IPV_ADCDIG_31201_BOLERO256K or Rainier */
#else /* Calypso */
  #define ADC_UNUSED_THRESHOLD          (0x0UL)
  /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
  #define ADC_THRHLR_RESET_VALUE(unit)  (((unit) == (uint8)0) ? (0x03FF0000UL) : (0x0FFF0000UL))
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10) */
/**********************************************************************************
***************        Presampling Control Register (PSCR)         **************
**********************************************************************************/

/* if !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
/**
* @brief          PRECONV.
* @details        Convert presampled value.
*                 If bit PRECONV is set, presampling is followed by the conversion.
*                 Sampling will be bypassed and conversion of presampled data will be done.
*/
#define ADC_PSCR_PRECONV_EN (0x00000001UL)
#define ADC_PSCR_PRECONV_DIS (0x0UL)

/**
* @brief          PREVAL0[0:1].
* @details        Internal voltage selection for presampling.
*                 Selects analog input voltage for presampling from the available internal 
*                 voltages (internal precision channels).
*/
/* if !Panther and !Rainier and !Calypso */
#if (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && \
    (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
    #define ADC_PSCR_PREVAL0_VSS_ZERO_VOLT (0x0UL)
    #define ADC_PSCR_PREVAL0_VSS_FIVE_VOLT (0x00000002UL)
#else
    /* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
    #define ADC_PSCR_PREVAL0_AGND_THREE_VOLT (0x0UL)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
    #define ADC_PSCR_PREVAL0_AVDD_THREE_VOLT (0x00000002UL)
    #define ADC_PSCR_PREVAL0_VREFL (0x00000004UL)
    #define ADC_PSCR_PREVAL0_VREFH (0x00000006UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) &&
          (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10) */

/**
* @brief          PREVAL1[0:1].
* @details        Internal voltage selection for presampling.
*                 Selects analog input voltage for presampling from the available two internal
*                 voltages (internal extended channels).
*/
/* if !Panther and !Rainier and !Calypso */
#if (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && \
    (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
    #define ADC_PSCR_PREVAL1_VSS_ZERO_VOLT (0x0UL)
    #define ADC_PSCR_PREVAL1_VSS_FIVE_VOLT (0x00000008UL)
#else
    /* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
    #define ADC_PSCR_PREVAL1_AGND_THREE_VOLT (0x0UL)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
    #define ADC_PSCR_PREVAL1_AVDD_THREE_VOLT (0x00000008UL)
    #define ADC_PSCR_PREVAL1_VREFL (0x00000010UL)
    #define ADC_PSCR_PREVAL1_VREFH (0x00000018UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) &&
          (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10) */

/**
* @brief          PREVAL2[0:1].
* @details        Internal voltage selection for presampling.
*                 Selects analog input voltage for presampling from the available two internal
*                 voltages (external channels).
*/
/* if !Panther and !Rainier and !Calypso */
#if (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && \
    (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
    #define ADC_PSCR_PREVAL2_VSS_ZERO_VOLT (0x0UL)
    #define ADC_PSCR_PREVAL2_VSS_FIVE_VOLT (0x00000020UL)
    /* Rainier or Calypso */
#elif (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
    #define ADC_PSCR_PREVAL2_AGND_THREE_VOLT (0x0UL)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_3 Identifier exceeds 31 characters */
    #define ADC_PSCR_PREVAL2_AVDD_THREE_VOLT (0x00000020UL)
    #define ADC_PSCR_PREVAL2_VREFL (0x00000040UL)
    #define ADC_PSCR_PREVAL2_VREFH (0x00000060UL)
#else /* Panther */
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) */

#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */


/**********************************************************************************
***************        Presampling Register (PSR[0..2])         **************
**********************************************************************************/
/* if !Pictus512_256 */
#if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
/**
* @brief          ADC_PSR_CH_EN.
* @details        Presampling register channel.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_PSR_CH_EN(Ch) ((uint32)(1<<(Ch)))
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */

/**********************************************************************************
***************        Conversion Timing Register (CTRx)         **************
**********************************************************************************/
#ifdef IPV_ADCDIG
/* !Panther and !Rainier and !Calypso */
#if (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && \
    (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
/**
* @brief          INPLATCH.
* @details        Configuration bit for Latching phase duration.
*                 - 0b means half clock cycle;
*                 - 1b means 1 clock cycle.
*                 The 1b condition is possible only if INPCMP is bigger than 01b otherwise it is
*                 automatically set to 0b inside the ADC.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_INPLATCH_VALUE(x) ((uint16)((uint16)(x)<<15))

/**
* @brief          Half ot onne clock.
*/
#define ADC_HALF_CLOCK_CYCLE          (0x0U)
#define ADC_ONE_CLOCK_CYCLE           (0x1U)

