ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#ifdef IPV_ADCDIG
 /* if Pictus512_256 or Leopard or Leopard cut2/cut3 or Pictus1M or Komodo 2M */
 #if (IPV_ADCDIG == IPV_ADCDIG_00_01_06_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || \
     (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01)  || (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01)
/**
* @brief          ADC_NO_SHIFT, ADC_AVIN_1_2_LSB, ADC_AVIN_0
*/
#define ADC_NO_SHIFT                  (0x0U)
#define ADC_AVIN_1_2_LSB              (0x1U)
#define ADC_AVIN_0                    (0x2U)
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_OFFSETSHIFT_VALUE(x) ((uint16)((uint16)(x)<<12))
 #endif /* (IPV_ADCDIG == IPV_ADCDIG_00_01_06_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) ||
           (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01)*/
#endif /* IPV_ADCDIG */

/**
* @brief          INPCMP.
* @details        Configuration bits for the comparison duration.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_INPCMP_VALUE(x) ((uint16)((uint16)(x)<<9))

/**
* @brief          Zero, one, two or three latch cycle values.
*/
#define ADC_ZERO_LATCH_CYCLE          (0x0U)
#define ADC_ONE_LATCH_CYCLE           (0x1U)
#define ADC_TWO_LATCH_CYCLE           (0x2U)
#define ADC_THREE_LATCH_CYCLE         (0x3U)
#define ADC_FOUR_LATCH_CYCLE          (0x0U)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) &&
          (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10) */

/**
* @brief          INPSAMP.
* @details        Configuration of sampling phase duration.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_INPSAMP_VALUE(x) ((uint16)(x))

/* if Leopard cut2/cut3 or Pictus1M or Panther or Rainier */
#if (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) || \
    (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12)
 /* if !Pictus1M */
 #ifndef IPV_ADCDIG_31301_PICTUS1M
/**
* @brief          INPSAMP.
* @details        Configuration of sampling phase duration.
*/
 /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
 #define ADC_INPSAMP1_VALUE(x) ((uint16)((uint16)(x)<<1))
 #endif /* IPV_ADCDIG_31301_PICTUS1M */
#endif /* (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_03_01) ||
          (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) */

/**
* @brief          CTRx reset values.
*/
/* !Panther and !Rainier and !Calypso */
#if (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) && \
    (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10)
#define ADC_CTR0_RESET_VALUE          (0x203UL)
#define ADC_CTR1_RESET_VALUE          (0x203UL)
#define ADC_CTR2_RESET_VALUE          (0x203UL)
#else
#define ADC_CTR0_RESET_VALUE          (0x16UL)
#define ADC_CTR1_RESET_VALUE          (0x16UL)
#define ADC_CTR2_RESET_VALUE          (0x16UL)
#endif /* (IPV_ADCDIG != IPV_ADCDIG_00_00_03_01) && (IPV_ADCDIG != IPV_ADCDIG_00_00_04_12) &&
          (IPV_ADCDIG != IPV_ADCDIG_00_00_04_10) */
#endif /* IPV_ADCDIG */
/**********************************************************************************
***************   Normal Conversion Mask Register (NCMRx)            **************
**********************************************************************************/
/**
* @brief          When set, sampling is enabled for channel n.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_NORMAL_CONV_CH_EN(Ch) ((uint32)((uint32)1<<(uint32)(Ch)))

/**
* @brief          NCMR register reset value.
*/
#define ADC_NCMR_RESET_VALUE          (0x0UL)

/**
* @brief          Adc channel id.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_ID_CHANNEL(id)            ((uint32)(id))

/**********************************************************************************
***************  Injected Conversion Mask Register (JCMRx)           **************
**********************************************************************************/
/**
* @brief          When set, inj sampling is enabled for channel n.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_INJ_CONV_CH_EN(Ch) ((uint32)(1<<(Ch)))

/**
* @brief          JCMR register reset value.
*/
#define ADC_JCMR_RESET_VALUE          (0x0UL)

/*********************************************************************************
*************** Decode Signals Delay Register (DSDR)               ***************
**********************************************************************************/
/**
* @brief          DSDR.
* @details        The delay between the external decode signals and the start of the sampling
*                 phase. It is used to take into account the settling time of the external mux.
*/
#ifdef IPV_ADCDIG
 /* if !Pictus512_256 */
 #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01)
 /* if Bolero 1.5M or Leopard or Bolero 3M or Rainier or Calypso */
  #if (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) || \
      (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) || \
      (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10)
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define MUX_DELAY_VALUE(x) ((uint16)(x))
  #else
    /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
    #define MUX_DELAY_VALUE(x) ((uint8)(x))
  #endif /* #if (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_02_00_01) ||
                (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_00_04_12) ||
                (IPV_ADCDIG == IPV_ADCDIG_00_00_04_10) */
 #endif /* #if (IPV_ADCDIG != IPV_ADCDIG_00_01_06_01) */
#else
  /* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
  #define MUX_DELAY_VALUE(x) ((uint8)(x))
#endif /* #ifdef IPV_ADCDIG */

/**********************************************************************************
*************** Power-Down Exit Delay Registers (PDEDR)              **************
**********************************************************************************/
/**
* @brief          PDED.
* @details        The delay between the power-down bit reset and the starting of conversion.
*/
/* @violates @ref Reg_eSys_ADCDig_h_REF_1 Function-like macro defined */
#define ADC_POWERDOWN_EXIT_DELAY_VALUE(x) ((uint8)(x))

/**
* @brief          PDEDR register reset value.
*/
#define ADC_PDEDR_RESET_VALUE (0x0UL)


/**********************************************************************************
*************** Data Registers                                       **************
**********************************************************************************/

/**
* @brief          Mask used to verify the DATA registers content (VALID flag).
*/
#define ADC_VALID_DATA_MASK (0x00080000UL)


/**********************************************************************************
******    ADCDig ERRATA switches
**********************************************************************************/

