ace-knu/autosar/mpc5606b/exercises/backup_Base/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Adc_freescale_MPC560xB/include/Reg_eSys_ADCDig.h
#ifdef IPV_ADCDIG
  /* If Bolero 3M (or Bolero 256k-128k) OR Bolero 512K OR Bolero 1.5M */
  #if (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_01_08_01) || \
      (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01)

    /* If Errata workaround is enabled */
    #if defined(ADC_ENABLE_ERRATA_INTERRUPTED_NORMAL_GROUP) && \
      (STD_ON == ADC_ENABLE_ERRATA_INTERRUPTED_NORMAL_GROUP) && \
      (defined(ERR_IPV_ADCDIG_0015)) && (STD_ON == ERR_IPV_ADCDIG_0015)

      /* @violates @ref Reg_eSys_ADCDig_h_REF_4 Re-use of C90 identifier pattern */
      #define ENABLE_ERR_IPV_ADCDIG_0015  (STD_ON)

    #else

      /* @violates @ref Reg_eSys_ADCDig_h_REF_4 Re-use of C90 identifier pattern */
      #define ENABLE_ERR_IPV_ADCDIG_0015  (STD_OFF)

    #endif

    /* If Errata workaround is enabled */
    #if defined(ADC_ENABLE_ERRATA_OPTIMIZED_SW_ABORT) && \
      (STD_ON == ADC_ENABLE_ERRATA_OPTIMIZED_SW_ABORT) && \
      (defined(ERR_IPV_ADCDIG_0014)) && (STD_ON == ERR_IPV_ADCDIG_0014)

      /* @violates @ref Reg_eSys_ADCDig_h_REF_4 Re-use of C90 identifier pattern */
      #define ENABLE_ERR_IPV_ADCDIG_0014  (STD_ON)

    #else

      /* @violates @ref Reg_eSys_ADCDig_h_REF_4 Re-use of C90 identifier pattern */
      #define ENABLE_ERR_IPV_ADCDIG_0014  (STD_OFF)

    #endif
    
    #if defined(ERR_IPV_ADCDIG_0016) && (STD_ON == ERR_IPV_ADCDIG_0016)
      /* @violates @ref Reg_eSys_ADCDig_h_REF_4 Re-use of C90 identifier pattern */
      #define ENABLE_ERR_IPV_ADCDIG_0016  (STD_ON)
    #endif

  #endif /* if (IPV_ADCDIG == IPV_ADCDIG_00_03_12_01) || (IPV_ADCDIG == IPV_ADCDIG_00_01_08_01) || \
      (IPV_ADCDIG == IPV_ADCDIG_00_03_09_01) || (IPV_ADCDIG == IPV_ADCDIG_00_03_13_01) */
#endif /* ifdef IPV_ADCDIG */

#ifndef ENABLE_ERR_IPV_ADCDIG_0015
  /* @violates @ref Reg_eSys_ADCDig_h_REF_4 Re-use of C90 identifier pattern */
  #define ENABLE_ERR_IPV_ADCDIG_0015  (STD_OFF)
#endif

#ifndef ENABLE_ERR_IPV_ADCDIG_0014
  /* @violates @ref Reg_eSys_ADCDig_h_REF_4 Re-use of C90 identifier pattern */
  #define ENABLE_ERR_IPV_ADCDIG_0014  (STD_OFF)
#endif

#ifndef ENABLE_ERR_IPV_ADCDIG_0016
  /* @violates @ref Reg_eSys_ADCDig_h_REF_4 Re-use of C90 identifier pattern */
  #define ENABLE_ERR_IPV_ADCDIG_0016  (STD_OFF)
#endif

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/

/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/

/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/

#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_ADCDIG_H */

/** @} */
